; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	image0 - mode
	thermograph1 - mode
	Star4 - direction
	Star1 - direction
	Star5 - direction
	Star3 - direction
	GroundStation8 - direction
	Star0 - direction
	Star7 - direction
	Star2 - direction
	GroundStation6 - direction
	Star9 - direction
	Phenomenon10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 image0)
	(calibration_target instrument0 Star0)
	(calibration_target instrument0 Star5)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star2)
	(calibration_target instrument1 Star5)
	(supports instrument2 thermograph1)
	(supports instrument2 image0)
	(calibration_target instrument2 Star4)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 Star1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument3 thermograph1)
	(supports instrument3 image0)
	(calibration_target instrument3 GroundStation8)
	(calibration_target instrument3 Star1)
	(supports instrument4 image0)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 Star0)
	(supports instrument5 thermograph1)
	(calibration_target instrument5 Star0)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon10)
	(supports instrument6 thermograph1)
	(supports instrument6 image0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation6)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument7 thermograph1)
	(supports instrument7 image0)
	(calibration_target instrument7 Star0)
	(calibration_target instrument7 GroundStation8)
	(calibration_target instrument7 Star3)
	(supports instrument8 image0)
	(supports instrument8 thermograph1)
	(calibration_target instrument8 Star0)
	(calibration_target instrument8 Star7)
	(supports instrument9 thermograph1)
	(calibration_target instrument9 GroundStation6)
	(calibration_target instrument9 Star2)
	(calibration_target instrument9 Star7)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Phenomenon13)
)
(:goal (and
	(pointing satellite0 GroundStation6)
	(pointing satellite2 Star3)
	(pointing satellite3 GroundStation8)
	(have_image Star9 thermograph1)
	(have_image Phenomenon10 image0)
	(have_image Phenomenon11 thermograph1)
	(have_image Phenomenon12 image0)
	(have_image Phenomenon13 thermograph1)
))

)

; plan
1. (turn_to satellite2 star3 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 star3)
   goals met: 1 of 8
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 8
3. (calibrate satellite0 instrument0 star0)
   added: (calibrated instrument0)
   goals met: 1 of 8
4. (turn_to satellite0 phenomenon12 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon12)
   goals met: 1 of 8
5. (take_image satellite0 phenomenon12 instrument0 image0)
   added: (have_image phenomenon12 image0)
   goals met: 2 of 8
6. (turn_to satellite0 phenomenon11 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon11)
   goals met: 2 of 8
7. (take_image satellite0 phenomenon11 instrument0 thermograph1)
   added: (have_image phenomenon11 thermograph1)
   goals met: 3 of 8
8. (turn_to satellite0 phenomenon10 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 phenomenon10)
   goals met: 3 of 8
9. (take_image satellite0 phenomenon10 instrument0 image0)
   added: (have_image phenomenon10 image0)
   goals met: 4 of 8
10. (turn_to satellite0 phenomenon13 phenomenon10)
   deleted: (pointing satellite0 phenomenon10)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 8
11. (take_image satellite0 phenomenon13 instrument0 thermograph1)
   added: (have_image phenomenon13 thermograph1)
   goals met: 5 of 8
12. (turn_to satellite0 star9 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star9)
   goals met: 5 of 8
13. (take_image satellite0 star9 instrument0 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 6 of 8
14. (turn_to satellite0 groundstation6 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 groundstation6)
   goals met: 7 of 8
15. (turn_to satellite3 groundstation8 phenomenon13)
   deleted: (pointing satellite3 phenomenon13)
   added: (pointing satellite3 groundstation8)
   goals met: 8 of 8
